Reports/ДетализацияВзаиморасчетовСКонтрагентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ДетализацияВзаиморасчетовСКонтрагентом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМонтажа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ДетализацияВзаиморасчетовСКонтрагентом/Forms/УДАЛИТЬ_ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Если ПолучитьКоличествоСтраницВОтчете() = 0 Тогда
		ПоказатьОповещениеПользователя("Сначала необходимо сформировать отчет");
		Возврат;
	КонецЕсли;
		
	Если Вопрос("Создать новое электронное письмо?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		СсылкаНаЭлектронноеПисьмо = СформироватьЭлектронноеПисьмоСОтчетом();
		
		Парам = Новый Структура("Ключ",СсылкаНаЭлектронноеПисьмо);
		ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",Парам);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьЭлектронноеПисьмоСОтчетом()
	
	
	//Контрагент
	Попытка
		ИдНастройкиКонтрагент = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(0).ИдентификаторПользовательскойНастройки;
		Контрагент = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдНастройкиКонтрагент).ПравоеЗначение;
	Исключение
	КонецПопытки;	
	//НачалоПериода
	Попытка
		ИдНастройкиНачалоПериода = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода").ИдентификаторПользовательскойНастройки;
		НачалоПериода = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдНастройкиНачалоПериода);
		Если НачалоПериода.Использование Тогда
			Отчет.ПериодНачало = НачалоПериода.Значение.Дата;
		Иначе 
			Отчет.ПериодНачало = Дата(1,1,1);
		КонецЕсли;
	Исключение
	КонецПопытки;	
	//КонецПериода
	Попытка
		ИдНастройкиКонецПериода = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода").ИдентификаторПользовательскойНастройки;
		КонецПериода = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдНастройкиКонецПериода);
		Если КонецПериода.Использование Тогда
			Отчет.ПериодКонец = КонецПериода.Значение.Дата;
		Иначе
			Отчет.ПериодКонец = Дата(1,1,1);
		КонецЕсли;	
	Исключение
	КонецПопытки;	
		
	Возврат РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмоСОтчетом(Результат, "Акт сверки с " + Формат(Отчет.ПериодНачало,"ДЛФ=Д") + " по " + Формат(Отчет.ПериодКонец,"ДЛФ=Д"), 
	Контрагент, "xls");
		
КонецФункции

&НаСервере
Функция ПолучитьКоличествоСтраницВОтчете()
	Возврат Результат.КоличествоСтраниц();
КонецФункции

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Настройки);	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СохранитьПользовательскиеНастройкиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройкиНаСервере()
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
КонецПроцедуры	

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Контрагент
	Попытка
		Если НЕ Параметры.Контрагент.Пустая() Тогда
			Отчет.Контрагент = Параметры.Контрагент.Ссылка;
		КонецЕсли;	
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если НЕ Отчет.Контрагент.Пустая() Тогда
		ИдНастройкиКонтрагент = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(0).ИдентификаторПользовательскойНастройки;
		КонтрагентСКД = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдНастройкиКонтрагент);
		КонтрагентСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонтрагентСКД.Использование = Истина;
		КонтрагентСКД.ПравоеЗначение = Отчет.Контрагент;
		Отчет.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
